web/app/controllers/client_api/auth_controller.rb

  def create
    if params.has_key?(:arc_token)
      user = User.where("token = ?", params[:arc_token]).first
---
SELECT  "users".* FROM "users" WHERE (token = 'zwl42ixhzshhfajvt8likv8ujkyoxlrn') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]